In [1]:
import pandas as pd
#Series - 1 D array
#Creating
data=[1,2,3,4,5,6]
data=pd.Series(data)
print(data)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [ ]:
import random
import pandas as pd
char=['a','b','c','d','e','f','g']
lst=[]
char_str=[]
for i in range(5):
  word= ''.join(random.choices(char,k=5))
  lst.append(word)
  char_str.append(word[0:3])
print(lst)

data=pd.Series(lst)
print(data)

upper_case_series=data.str.upper()
print(upper_case_series)
data_series=pd.Series(char_str)
print(data_series)

['agcfg', 'dagbc', 'cfbbd', 'ceabc', 'aaafe']
0    agcfg
1    dagbc
2    cfbbd
3    ceabc
4    aaafe
dtype: object
0    AGCFG
1    DAGBC
2    CFBBD
3    CEABC
4    AAAFE
dtype: object
0    ag
1    da
2    cf
3    ce
4    aa
dtype: object

In [ ]:
data={'a':1,'b':2,'c':3,'d':4}
pd.Series(data)

data1=[10,20,30,40,50]
index=[1,2,3,4,5]
pd.Series(data1,index=index)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [22]:
data={
  'name': ['Rohini','Rahul','Jack'],
  'age':[25,26,28],
  'city':['Mumbai','Pune','Mumbai']
}

print(data)
# data=pd.DataFrame(data)
# print("DataFrame: \n ",data)
pd.DataFrame(data)

{'name': ['Rohini', 'Rahul', 'Jack'], 'age': [25, 26, 28], 'city': ['Mumbai', 'Pune', 'Mumbai']}

     name  age    city
0  Rohini   25  Mumbai
1   Rahul   26    Pune
2    Jack   28  Mumbai

In [35]:
df=pd.read_csv('data.csv')
print(type(df))
print('-------------------------')
print(df.head(6))
print('-------------------------')
print(f"{df.tail(5)}")

<class 'pandas.core.frame.DataFrame'>
-------------------------
         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
-------------------------
          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [53]:
data={
  'name': ['Rohini','Rahul','Jack'],
  'age':[25,26,28],
  'city':['Mumbai','Pune','Mumbai']
}

data=pd.DataFrame(data)
print("DataFrame: \n ",data)
print('-------------------------')
print('Read data using loc')
print('-------------------------')
print(data.loc[0])
print('-------------------------')
print(data.loc[2, 'age']) 
# print('-------------------------')
print(data.loc[1,['name','city']])

DataFrame:
       name  age    city
0  Rohini   25  Mumbai
1   Rahul   26    Pune
2    Jack   28  Mumbai
-------------------------
Read data using loc
-------------------------
name    Rohini
age         25
city    Mumbai
Name: 0, dtype: object
-------------------------
28
name    Rahul
city     Pune
Name: 1, dtype: object

In [66]:
print("DataFrame: \n ",data)
print('-------------------------\n')
print('Read data using iloc')
print('-------------------------')
print(data.iloc[0])
print('-------------------------')
print(data.iloc[1,[0,2]])


#add column
data['salary']=[50000,60000,70000]
print(data)
data.drop('salary',axis=1,inplace=True)
print(data)

DataFrame:
       name  age    city  salary
0  Rohini   25  Mumbai   50000
1   Rahul   26    Pune   60000
2    Jack   28  Mumbai   70000
-------------------------

Read data using iloc
-------------------------
name      Rohini
age           25
city      Mumbai
salary     50000
Name: 0, dtype: object
-------------------------
name    Rahul
city     Pune
Name: 1, dtype: object
     name  age    city  salary
0  Rohini   25  Mumbai   50000
1   Rahul   26    Pune   60000
2    Jack   28  Mumbai   70000
     name  age    city
0  Rohini   25  Mumbai
1   Rahul   26    Pune
2    Jack   28  Mumbai